# 36. Дан список чисел. Создайте список, в который попадают числа,
#  описывающие максимальную возрастающую последовательность. 
#  Порядок элементов менять нельзя.

# *Пример:*

# [1, 5, 2, 3, 4, 6, 1, 7] => [1, 7]
# [1, 2, 8, 1 2, 3, 4, 1, 7] => [1, 4]

seq = [1, 5, 2, 3, 4, 6, 1, 7]
seq_2 = []

for i in range(0, len(seq)):
    temp = seq[i]
    for j in range(1, len(seq) - 1):
        if seq[i] > seq[j]:
            seq_2.append(seq[i])
        elif seq[i] < seq[j]:
            seq_2.append(seq[j])
        
    seq[i] = temp

print(seq_2)